Revit 2026 API

# UVDistanceTo Method

---

Returns the distance from this 2-D point to the specified 2-D point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DistanceTo(
	UV source
)
```
```vb
Public Function DistanceTo (
	source As UV
) As Double
```
```cpp
public:
double DistanceTo(
	UV^ source
)
```
```fsharp
member DistanceTo :
        source : UV -> float
```

#### Parameters

source UV
    The specified point.

#### Return Value

DoubleThe real number equal to the distance between the two points.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The distance between the two points is equal to the length of the vector that joins the two points.

#### Reference

UV Class

Autodesk.Revit.DB Namespace